Autodesk.Revit.DB.FabricationConfiguration.GetItemFoldersUsedByServices(System.Collections.Generic.IList{System.Int32})
Gets a list of every fabrication item folder used by services.
serviceIds:
list of service identifiers to check.
Returns:
Returns a list of every fabrication item folder used by services.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialThickness(System.Int32,System.Int32)
Gets material thickness from its material/gauge identifiers.
materialId:
The material identifier.
gaugeId:
The gauge identifier within the specified material.
Returns:
The thickness of the material/gauge.
Since:
2024

Autodesk.Revit.DB.FabricationConfiguration.UnloadServicesAndItemFiles(System.Collections.Generic.IList{System.Int32},System.Collections.Generic.IList{System.String})
Unload the specific fabrication service from project.
serviceIds:
The identifiers of the fabrication services to unload.
itemFiles:
The relative filenames of the fabrication item files to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication item files can not be unloaded if they are in use currently.
-or-
Some item files have not been loaded.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.UnloadItemFilesInternal(System.Collections.Generic.IList{System.String})
Unload the specified fabrication item files from the project.
itemFiles:
The fabrication item files to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication item files can not be unloaded if they are in use currently.
-or-
Some item files have not been loaded.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.AreItemFilesLoadedInternal(System.Collections.Generic.IList{System.String})
Checks if the item files have been loaded.
itemFilePaths:
The paths of the item files.
Returns:
Returns true if the item files have been loaded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.CanUnloadItemFilesInternal(System.Collections.Generic.IList{System.String})
Checks if the fabrication item files are already in use and should not be unloaded.
itemFiles:
The fabrication item files to unload.
Returns:
Returns true if the fabrication item files can be unloaded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.LoadItemFilesInternal(System.Collections.Generic.IList{System.String})
Loads the specified fabrication item files into the project.
itemFiles:
The relative paths of the fabrication item files to load.
Returns:
The relative paths of the fabrication item files which failed to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
-or-
this operation failed.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.FinaliseConfigurationChanges(System.Boolean)
Finalise a temporary configuration and make it permanent
keepChanges:
if true the changes are persisted to the buffer else the configuration is rebuilt from the current buffer.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.BeginConfigurationChanges
Begin temporary configuration changes (optimise recording)
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.SetTemporaryConfiguration(Autodesk.Revit.DB.FabricationConfigurationInfo,System.String)
Set a temporary configuration that can be adjusted before being finalised
fabricationConfigurationInfo:
The desired fabrication configuration.
profile:
The desired profile of the fabrication configuration. Use empty string for the global profile.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication configuration cannot be swapped because the exiting fabrication configuration has already been used in the document.
-or-
Cannot set the configuration.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetAllLoadedItemFiles
Get list of all loaded fabrication item files.
Returns:
Returns an array of the loaded fabrication item files.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication configuration is not set yet.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialGaugeGUID(System.Int32,System.Int32)
Gets the material gauge GUID by its material/gauge identifiers.
materialId:
The material identifier. The same material gauge GUID could have different material gauge identifiers for different materials.
gaugeId:
The material gauge identifier.
Returns:
The material gauge GUID. Returns empty GUID if not found.
Since:
2024

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialGaugeByGUID(System.Guid,System.Int32)
Gets the material gauge identifier by its GUID and material identifier.
gaugeGUID:
The material gauge GUID.
materialId:
The material identifier. The same material gauge GUID could have different material gauge identifiers for different materials.
Returns:
The gauge identifier. Returns 0 if not found.
Since:
2024

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialGUID(System.Int32)
Gets the material GUID by its identifier.
materialId:
The material identifier.
Returns:
The material GUID. Returns empty GUID if not found.
Since:
2024

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialByGUID(System.Guid)
Gets the material identifier by its GUID.
materialGUID:
The material GUID.
Returns:
The material identifier. Returns 0 if not found.
Since:
2024

Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationGUID(System.Int32)
Gets the specification GUID by its identifier.
specificationId:
The specification identifier.
Returns:
The specification GUID. Returns empty GUID if not found.
Since:
2024

Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationByGUID(System.Guid)
Gets the specification identifier by its GUID.
specificationGUID:
The specification GUID.
Returns:
The specification identifier. Returns 0 if not found.
Since:
2024

Autodesk.Revit.DB.FabricationConfiguration.GetServiceGUID(System.Int32)
Gets the service GUID by its identifier.
serviceId:
The service identifier.
Returns:
The service GUID. Returns empty GUID if not found.
Since:
2024

Autodesk.Revit.DB.FabricationConfiguration.GetServiceByGUID(System.Guid)
Gets the service identifier by its GUID.
serviceGUID:
The service GUID.
Returns:
The service identifier. Returns 0 if not found.
Since:
2024

Autodesk.Revit.DB.FabricationConfiguration.LocateFabricationConnector(System.String,System.String,Autodesk.Revit.DB.ConnectorDomainType,Autodesk.Revit.DB.ConnectorProfileType)
Gets the fabrication connector identifiers by group and name, filtered by shape and domain.
group:
The fabrication connector group.
name:
The fabrication connector name.
domain:
ConnectorDomainType to filter by. Pass ConnectorDomainType::Undefined to get all connector domains.
shape:
ConnectorProfileType to filter by. Pass ConnectorProfileType::Invalid to get all shapes.
Returns:
Return the fabrication connector identifier. Returns -1 if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationAbbreviation(System.Int32)
Gets specification abbreviation.
specificationId:
The specification identifier.
Since:
2017

Autodesk.Revit.DB.FabricationConfiguration.LocateMaterial(System.String,System.String)
Gets material by group and name.
group:
The material group.
name:
The group name.
Returns:
The material identifier. Returns -1 if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.LocateInsulationSpecification(System.String,System.String)
Gets the insulation specification by group and name.
group:
The insulation specification group.
name:
The insulation specification name.
Returns:
The insulation specification identifier. Returns -1 if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetAllPartCustomData
Gets all possible fabrication part custom data identifiers.
Returns:
An array of custom data identifiers.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetAllPartStatuses
Gets all possible fabrication part status identifiers.
Returns:
An array of status identifiers.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.LocateSpecification(System.String,System.String)
Gets the specification identifier by group and name.
group:
The specification group.
name:
The specification name.
Returns:
The specification identifier. Returns -1 if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.UnloadItemFiles(System.Collections.Generic.IList{Autodesk.Revit.DB.FabricationItemFile})
Unload the specified fabrication item files from the project.
itemFiles:
The fabrication item files to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication item files can not be unloaded if they are currently in use.
-or-
Some fabrication item files have not been loaded.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.UnloadServices(System.Collections.Generic.IList{System.Int32})
Unload the specified fabrication services from the project.
serviceIds:
The identifiers of the fabrication services to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication services can not be unloaded if they are in use currently.
-or-
Some services are not loaded yet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.AreItemFilesLoaded(System.Collections.Generic.IList{Autodesk.Revit.DB.FabricationItemFile})
Checks if the fabrication item files have been loaded.
itemFiles:
The fabrication item files.
Returns:
Returns true if the fabrication item files have been loaded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.CanUnloadItemFiles(System.Collections.Generic.IList{Autodesk.Revit.DB.FabricationItemFile})
Checks if the fabrication item files are already in use and should not be unloaded.
itemFiles:
The fabrication item files to unload.
Returns:
Returns true if the fabrication item files can be unloaded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.LoadItemFiles(System.Collections.Generic.IList{Autodesk.Revit.DB.FabricationItemFile})
Loads the specified fabrication item files into the project.
itemFiles:
The relative paths of the fabrication item files to load.
Returns:
The relative paths of the fabrication item files which failed to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
-or-
this operation failed.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.LoadServices(System.Collections.Generic.IList{System.Int32})
Loads the specified fabrication services into the project.
serviceIds:
The identifiers of the fabrication services to load.
Returns:
The identifiers of the fabrication services which failed to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
-or-
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.SetServicesToLoad(System.Collections.Generic.IList{System.Int32})
Sets the services which are to be loaded or not next time reloadConfiguration is called. If a service is not included but is currently loaded then it will be unloaded then.
Returns:
Returns true if successful. May fail if any service currently loaded is not included and is in use so cannot be unloaded.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FabricationConfiguration.SetConfiguration(Autodesk.Revit.DB.FabricationConfigurationInfo,System.String)
Set the fabrication configuration with specific profile.
fabricationConfigurationInfo:
The desired fabrication configuration.
profile:
The desired profile of the fabrication configuration. Use empty string for the global profile.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The profile "profile" is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication configuration cannot be swapped because the exiting fabrication configuration has already been used in the document.
-or-
Cannot set the configuration.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConfiguration(Autodesk.Revit.DB.Document)
Gets the fabrication configuration element in the document.
document:
The document.
Returns:
The fabrication configuration element in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016